---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.GenericZone
source: html/b51c1d56-766b-e080-3597-4d86a072963f.htm
---
# GenericZone Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.